from email.policy import default


defaultBgColor = '#393232'  # '#7C7575'  # '#FBF0F0'  # '#1b2d55'  # Основной фон (глубокий синий)
defaultFontColor = '#FFFFFF' # '#f0ffff'  # Основной цвет шрифта (почти белый, для контраста)
secondaryBgColor = '#4D4545'#21365d'  # Фон для боковой панели или второстепенных элементов (чуть светлее основного)
secondaryFontColor = '#7ab2ff'  # Цвет шрифта для второстепенных элементов (ярко-голубой)
inputBgColor = '#2d4a71'  # Фон полей ввода (отличается от основного, чтобы выделяться)
hoverBgColor = '#4a9bff'  # Цвет фона при наведении (яркий голубой, для визуального отклика)
menuFontColor = '#ED8D8D'#8D6262' #b1b3b4'  # Цвет текста в меню (серебристый, чтобы выделяться на темном фоне)
defaultWithWindow = 1500  # Ширина окна по умолчанию
defaultHeightWindow = 1000  # Высота окна по умолчанию
